CSI API ETABS v1
cAreaObj.SetGroupAssign Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetGroupAssign(
	string Name,
	string GroupName,
	bool Remove = false,
	eItemType ItemType = eItemType.Objects
)
Function SetGroupAssign (
	Name As String,
	GroupName As String,
	Optional Remove As Boolean = false,
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim GroupName As String
Dim Remove As Boolean
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.SetGroupAssign(Name,
	GroupName, Remove, ItemType)
int SetGroupAssign(
	String^ Name,
	String^ GroupName,
	bool Remove = false,
	eItemType ItemType = eItemType::Objects
)
abstract SetGroupAssign :
        Name : string *
        GroupName : string *
        ?Remove : bool *
        ?ItemType : eItemType
(* Defaults:
        let _Remove = defaultArg Remove false
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
GroupName
Type: System.String
Remove (Optional)
Type: System.Boolean
ItemType (Optional)
Type: ETABSv1.eItemType
Return Value
Type: Int32
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace